SM_для_EDT/src/Enums/рарусВидыОперацийПриходаТМЦ/рарусВидыОперацийПриходаТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусВидыОперацийПриходаТМЦ</name>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ПриходПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеИзлишков</name>
    <comment>makole ФТ.ИМ.01.01</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПродуктовПитания</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаНавигационныхКарт</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/рарусСостояниеОтправкиОбъекта/рарусСостояниеОтправкиОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусСостояниеОтправкиОбъекта</name>
  <comment>rarus makole 29032021</comment>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированКОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженИзБМ</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/впПриходТМЦ/впПриходТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впПриходТМЦ</name>
  <basedOn>Document.впЗаявкаНаСнабжение</basedOn>
  <basedOn>Document.рарусИнвентаризацияТМЦ</basedOn>
  <registerRecords>AccumulationRegister.впТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.впТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.рарусИмуществоНаСудах</registerRecords>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.впЗаказПоставщику</types>
      <types>DocumentRef.впПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СформированСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.рарусВидыОперацийПриходаТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.рарусИнвентаризацияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОприходованиеБывшегоВУпотреблении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученВБМ</name>
    <comment>rarus atyutyakin ФТ.ИМ.02.01</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/CommonModules/впОбменТОиР20СМ31Обмен/Module.bsl
#Область Регистрация

#Область ПрограммныйИнтерфейс

Процедура ПередОбработкой(Отказ, Объект, ОбъектМетаданных, Выгрузка, ПРО) Экспорт

	ПередОбработкойВыполнить("впОбменТОиР20СМ31", Отказ, Объект, ОбъектМетаданных, Выгрузка, ПРО);		
	
КонецПроцедуры

Процедура ПослеОбработки(Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели) Экспорт

	ПослеОбработкиВыполнить("впОбменТОиР20СМ31", Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели);		
	
КонецПроцедуры

#Область ФункцииВызываемыеИзДругихМодулей

//Вызывается из модуля менеджера документа "Перемещение товаров"
//При выполнении загрузки документов перемещений из ЕИС
Процедура ПерезаполнитьДокументыПриходаТМЦ_ВФоне(ТаблицаЗагруженныхДокументов) Экспорт
	
	Для Каждого Строка Из ТаблицаЗагруженныхДокументов Цикл
		ДокументПриходаТМЦ = ДокументПриходаТМЦ(Строка.Документ);
		Если НЕ ДокументПриходаТМЦ.Пустая() Тогда
			//Перезаполнить и провести существующий документ//
			обДокументПрихода = ДокументПриходаТМЦ.ПолучитьОбъект();
			обДокументПрихода.СформированСМ = Ложь;
			обДокументПрихода.Комментарий = "Синхронизирован после новой загрузки перемещения из ЕИС";
			ПровестиДокументПриходаПоПеремещению(обДокументПрихода, Строка.Документ);
		ИначеЕсли Строка.Статус = "Принято" Тогда
			//Сформировать новый документ поступления, если он сформирован в ЕИС "За судно"
			обДокументПрихода = НовыйДокументПриходаТМЦ(Строка.Документ);
			ПровестиДокументПриходаПоПеремещению(обДокументПрихода, Строка.Документ);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
Функция ДокументПриходаТМЦ(ДокументПеремещения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	впПриходТМЦ.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.впПриходТМЦ КАК впПриходТМЦ
	                      |ГДЕ
	                      |	впПриходТМЦ.Распоряжение = &ДокументПеремещения
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	впПриходТМЦ.Проведен УБЫВ");
	Запрос.УстановитьПараметр("ДокументПеремещения", ДокументПеремещения);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Документы.впПриходТМЦ.ПустаяСсылка());
	
КонецФункции
Функция НовыйДокументПриходаТМЦ(ДокументПеремещения)
	
	обДокумент = Документы.впПриходТМЦ.СоздатьДокумент();
	обДокумент.СформированСМ = Истина;
	обДокумент.ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ПриходПоПеремещению;
	обДокумент.Распоряжение = ДокументПеремещения;
	обДокумент.Комментарий = "Автоматически сформирован по перемещению из ЕИС(За судно)";
	
	Возврат обДокумент;
	
КонецФункции
Процедура ПровестиДокументПриходаПоПеремещению(ДокументПриходаТМЦ, ДокументПеремещения)
	
	ДокументПриходаТМЦ.Дата = ДокументПеремещения.Дата + 1;
	ДокументПриходаТМЦ.Подразделение = ДокументПеремещения.СкладПолучатель;
	ДокументПриходаТМЦ.Ответственный = ПараметрыСеанса.АвторизованныйПользователь;
	ЗаполнитьЗначенияСвойств(ДокументПриходаТМЦ, ДокументПеремещения, "Организация");
	Если ДокументПриходаТМЦ.ПометкаУдаления Тогда
		ДокументПриходаТМЦ.ПометкаУдаления = Ложь;
	КонецЕсли;
	
	ДокументПриходаТМЦ.ТМЦ.Очистить();
	Для Каждого Строка Из ДокументПеремещения.ТМЦ Цикл
		НоваяСтрока = ДокументПриходаТМЦ.ТМЦ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,Количество,Заявка,КодСтроки");
	КонецЦикла;
	
	Попытка
		// ++ rarus PleA 13.05.2021 [29089 ]
		Если ЗначениеЗаполнено(ДокументПриходаТМЦ.Ссылка) тогда
			РегистрыСведений.рарусСостоянияОтправкиОбъектов.УстановитьСтатусОбъекта(ДокументПриходаТМЦ.Ссылка, ПредопределенноеЗначение("Перечисление.рарусСостояниеОтправкиОбъекта.ЗагруженИзБМ"));
		КонецЕсли;
		// -- rarus PleA
		ДокументПриходаТМЦ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстОшибки = "Ошибка проведения документа ПриходТМЦ на основании документа перемещения" + Символы.ПС + ОписаниеОшибки;
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ОбменЕИС",УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

Процедура ПередОбработкойВыполнить(ИмяПланаОбмена, Отказ, Объект, ОбъектМетаданных, Выгрузка, ПРО)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МодульМенеджера = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	МодульМенеджера.ПередОбработкой(ИмяПланаОбмена, Отказ, Объект, ОбъектМетаданных, Выгрузка, ПРО);
		
КонецПроцедуры

Процедура ПослеОбработкиВыполнить(ИмяПланаОбмена, Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МодульМенеджера = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	МодульМенеджера.ПослеОбработки(ИмяПланаОбмена, Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели);
		
КонецПроцедуры

#Область СлужебныйИнтерфейс

Процедура ЗарегистрироватьИзмененияДанных(Получатели, Ссылка, Знач ПроверятьРазрешениеВыгрузки=Истина) Экспорт
	
	Для Каждого Узел Из Получатели цикл
		
		ОбменДаннымиСобытия.ЗарегистрироватьИзмененияДанных(Узел, Ссылка, ПроверятьРазрешениеВыгрузки);
		
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти 

#КонецОбласти
